app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create({:title => params[:school_class][:title], :room_number => params[:school_class][:room_number]})
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-07-09 14:08:52.480524"], ["updated_at", "2018-07-09 14:08:52.480524"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    update_hash = {:title => params[:school_class][:title], :room_number => params[:school_class][:room_number]}
    @school_class.update(update_hash.permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-07-09 16:29:40.066577"], ["id", 1]]